In [5]:
import pandas as pd
import numpy as np
from pandas import Series,DataFrame

In [6]:
dict=({'team':['a','a','b','b','c','d'],'points':[2,4,5,5,7,7]})

In [7]:
df=DataFrame(dict)
df

  team  points
0    a       2
1    a       4
2    b       5
3    b       5
4    c       7
5    d       7

In [34]:
df.rename(index={0:'A',1:'b',3:'oo',4:'uuu'})

    team  points
N
A      a       2
b      a       4
2      b       5
oo     b       5
uuu    c       7
5      d       7

In [33]:
df

   team  points
N
A     a       2
b     a       4
2     b       5
oo    b       5
4     c       7
5     d       7

In [37]:
df.rename(columns= {'points': 'hjjj'})
df

   team  points
N
A     a       2
b     a       4
2     b       5
oo    b       5
4     c       7
5     d       7

In [38]:
df.rename_axis('names')

      team  points
names
A        a       2
b        a       4
2        b       5
oo       b       5
4        c       7
5        d       7

In [45]:
df

    N team  points
0   A    a       2
1   b    a       4
2   2    b       5
3  oo    b       5
4   4    c       7
5   5    d       7

In [49]:
df.groupby('team')

In [50]:
df

    N team  points
0   A    a       2
1   b    a       4
2   2    b       5
3  oo    b       5
4   4    c       7
5   5    d       7

In [100]:
#pivot table in pandas
df = pd.DataFrame({
    'Id': [1, 1, 1, 2, 2],
    'name':['A', 'A', 'A', 'B', 'B'],
    'team_name': ['rrrr', 'tthjt', 'rjjrr', 'thftt', 'ddd'],
    'playe_name': ['nnbvvb', 'cxzxzd', ' xczfd', 'xxx', 'kjhf']
})

In [101]:
 df.pivot(index=['Id','name'], columns='team_name', values='playe_name')

team_name   ddd   rjjrr    rrrr thftt   tthjt
Id name
1  A        NaN   xczfd  nnbvvb   NaN  cxzxzd
2  B       kjhf     NaN     NaN   xxx     NaN

In [102]:
Number = 100



# Convert the integer into a string using the format function

Str_value = '{}'.format(Number)



# Print the result

print('Your number is ', Str_value)

Your number is  100

In [ ]:
Name = input ('Enter your name: ')
Age = str(28)
print ('I am ' + Name + '. I am ' + Age + ' years old.')

In [104]:
# The integer value

Number = 100



# Convert the integer into a string using positional formatting

Str_value = "%s" % Number



# Print the result

print ('Your number is ', Str_value)

Your number is  100

In [105]:
Number = 100



# Convert the integer into a string using the __str__ method

Str_value = Number.__str__()



# Print the result

print('Your number is ', Str_value)

Your number is  100

In [110]:
# The integer value

Number = 100



# Convert the integer into a string using the format function

Str_value = '{}'.format(Number)



# Print the result
print(Str_value)

100